Documents/бит_СвидетельствоОРегистрацииПоМестуПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СвидетельствоОРегистрацииПоМестуПроживания</Name>
			<BasedOn>
				<xr:Item>Document.бит_ЗаявлениеОРегистрацииПоМестуПЖ</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеОРегистрацииПоМестуПЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыКонтактнойИнформации</Name>
			<Comment>БИТ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_СвидетельствоОРегистрацииПоМестуПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СвидетельствоОРегистрацииПоМестуПребывания</Name>
			<BasedOn>
				<xr:Item>Document.бит_ЗаявлениеОРегистрацииПоМестуПЖ</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеОРегистрацииПоМестуПЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/бит_СвидетельствоОРегистрацииПоМестуПроживания/Ext/ObjectModule.bsl
#Область ЭкспортныеПроцедурыИФункцииДокумента


#Если Клиент Тогда
// Функция формирует табличный документ с печатной формой сличительной ведомости.                      //
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьСОРПМЖ() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвидетельствоОРегистрацииПоМестуПроживания.Организация,
	|	СвидетельствоОРегистрацииПоМестуПроживания.Ответственный,
	|	СвидетельствоОРегистрацииПоМестуПроживания.Комментарий,
	|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет,
	|	СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание КАК ДомРег,
	|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Квартира КАК КвартираРег,
	|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	ПОДСТРОКА(СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо.МестоРождения, 1, 200) КАК МестоРождения
	|ИЗ
	|	Документ.бит_СвидетельствоОРегистрацииПоМестуПроживания КАК СвидетельствоОРегистрацииПоМестуПроживания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
	|		ПО СвидетельствоОРегистрацииПоМестуПроживания.Ответственный = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
	|ГДЕ
	|	СвидетельствоОРегистрацииПоМестуПроживания.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("СОРПМЖ");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	
	ЗапросЗаявление = Новый Запрос;
	ЗапросЗаявление.Текст = "ВЫБРАТЬ
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование.ОрганФМСКудаПрибыл.Руководитель КАК Руководитель,
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование.ДатаРегистрации КАК ДатаРегистрации
	                        |ИЗ
	                        |	Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК бит_СвидетельствоОРегистрацииПоМестуПребывания
	                        |ГДЕ
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.Ссылка = &Ссылка";
	ЗапросЗаявление.УстановитьПараметр("Ссылка", Документ);
	
	ВыборкаЗаявление = ЗапросЗаявление.Выполнить().Выбрать();
	
	Если ВыборкаЗаявление.Следующий() Тогда
		
		Если ЗначениеЗаполнено(ВыборкаЗаявление.Руководитель) Тогда
		ШапкаОбласть.Параметры.ФИОРуководителя  = ПолучитьИнициалы(ВыборкаЗаявление.Руководитель);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ПочтовыйАдрес) Тогда                 
		
		АдресПрибытия = Строка(Выборка.ПочтовыйАдрес);
	ИначеЕсли ЗначениеЗаполнено(ЛицевойСчет) Тогда
		АдресПрибытия = "ул. " + Строка(Выборка.УлицаРег) + ", д. " + Строка(Выборка.ДомРег)
		+ ?(ЗначениеЗаполнено(Выборка.КорпусРег),", корп." + Строка(Выборка.КорпусРег),"");
	КонецЕсли;
	
	АдресПрибытия = Строка(АдресПрибытия) + ?(ЗначениеЗаполнено(Выборка.КвартираРег),"кв. " + Строка(Выборка.КвартираРег),"");
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
		// БИТ_ЖКХ изменения кода . Начало: 23.08.2012
		
		Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
			РегистрируемоеЛицоФИО = Строка(Выборка.Фамилия)+" "+ Строка(Выборка.Имя)+" "+Строка(Выборка.Отчество);
		Иначе
			РегистрируемоеЛицоФИО = Строка(Выборка.РегистрируемоеЛицо);
		КонецЕсли;
		ФизЛицо_Склон = "";
		// БИТ_ЖКХ изменения кода: 31.08.2012
		ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(РегистрируемоеЛицоФИО,3,Выборка.РегистрируемоеЛицо.Пол,ФизЛицо_Склон);
		
		Если ИсходСклонения Тогда
			РегистрируемоеЛицоФИО = ФизЛицо_Склон;
		КонецЕсли;	
		
		РегистрируемоеЛицоФИО = РегистрируемоеЛицоФИО + ?(ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения), ", "+Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='yyyy ""г.р.""'"), "");
		ШапкаОбласть.Параметры.ФизЛицо = РегистрируемоеЛицоФИО;
		
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.МестоРождения) Тогда
			МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Выборка.РегистрируемоеЛицо.МестоРождения, Истина);
			
			
			МестоРождения_1 = "";
			МестоРождения_2 = "";
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоРождения, 75, МестоРождения_1, МестоРождения_2);
			ШапкаОбласть.Параметры.МестоРождения = МестоРождения_1;
			ШапкаОбласть.Параметры.МестоРождения2 = МестоРождения_2;
		КонецЕсли;
		
		АдресПрибытияРегистрируемого = бит_ПаспортныйСтолСервер.ПолнаяКонтактнаяИнформацияПоОбъекту(РегистрируемоеЛицо,Перечисления.бит_ТипыКонтактнойИнформации.Адрес, Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего).Представление;
		Если ЗначениеЗаполнено(АдресПрибытияРегистрируемого) тогда
			АдресПрибытия = АдресПрибытияРегистрируемого;
		КонецЕсли;
		
		// БИТ_ЖКХ изменения кода . Конец  23.08.2012
	КонецЕсли; 
	// БИТ_ЖКХ изменения кода . Конец  23.08.2012
	АдресПрибытия_1 = "";
	АдресПрибытия_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 71, АдресПрибытия_1, АдресПрибытия_2);
	ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
	ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
	
	// БИТ_ЖКХ изменения кода: 24.04.2012
	
	// БИТ_ЖКХ добавление кода Начало: 24.08.2012 
	Если ЗначениеЗаполнено(Выборка.ВыданДокумент) Тогда
		ВыданДокумент = Строка(Выборка.ВыданДокумент) + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения)," код " + Строка(Выборка.ДокументКодПодразделения) ,"");
		ВыданДокумент_1 = "";
		ВыданДокумент_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ВыданДокумент, 30, ВыданДокумент_1, ВыданДокумент_2);
		ШапкаОбласть.Параметры.ВыданДокумент_1 = ВыданДокумент_1;
		ШапкаОбласть.Параметры.ВыданДокумент_2 = ВыданДокумент_2;
	КонецЕсли;	 
	// БИТ_ЖКХ добавление кода конец : 24.08.2012
	
	Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
		
		// БИТ_ЖКХ добавление кода Начало: 24.08.2012 
		Если ЗначениеЗаполнено(Выборка.ДомРег.ПаспортнаяСлужба) Тогда
			ОрганУчета = Строка(Выборка.ДомРег.ПаспортнаяСлужба);
			ОрганУчета_1 = "";
			ОрганУчета_2 = "";
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ОрганУчета, 35, ОрганУчета_1, ОрганУчета_2);
			ШапкаОбласть.Параметры.ОрганУчета_1 = ОрганУчета_1;
			ШапкаОбласть.Параметры.ОрганУчета_2 = ОрганУчета_2;
			
		
						
			// БИТ_ЖКХ добавление кода конец : 24.08.2012
		КонецЕсли;			
		
	КонецЕсли;
	
	// БИТ_ЖКХ добавление кода Начало: 24.08.2012
	ШапкаОбласть.Параметры.ДеньВыдачи   = День(Дата);
	ДатаМесяц							= Формат(Дата,"ДФ=dd.MM.yy");
	ШапкаОбласть.Параметры.МесяцВыдачи 	= Сред(ДатаМесяц, 4, 2);
	ШапкаОбласть.Параметры.ГодВыдачи    = Формат(Дата,"ДФ=yy");
	// БИТ_ЖКХ добавление кода конец : 24.08.2012
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьСОРПМЖ()

// Процедура осуществляет печать документа. Можно направить печать на. 
// Экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// По переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "СОРПМЖ" тогда
		
		ТабДокумент = ПечатьСОРПМЖ();
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("СОРПМЖ","Свидетельство о регистрации по месту жительства");
	
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	// БИТ_ЖКХ изменения кода: 31.08.2012
	// Если ТипЗнч(Основание) = Тип("ДокументСсылка.бит_ЗаявлениеОРегистрацииПоМестуПЖ")Тогда.
	Если ТипЗнч(Основание) <> Тип("Структура") И Основание <> Неопределено Тогда
		
		СуществующийДок = НайтиПодчиненныйДокумент(Основание);
		
		Если ЗначениеЗаполнено(СуществующийДок) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='На основании документа %1 был введен %2'"),
			Основание,
			СуществующийДок);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ЗапретитьВвод=Истина;
			
		КонецЕсли;
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		Дата = Основание.Дата;
		
		ПараметрыДокументаОснования = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(Основание);
		ВидДокументаОснования       = Основание.Метаданные().Имя;
		
		ДокументОснование = ПараметрыДокументаОснования.Ссылка;
		
		Если ВидДокументаОснования = "бит_ЗаявлениеОРегистрацииПоМестуПЖ" Тогда 
			
			ЛицевойСчет        = ДокументОснование.ЛицевойСчет;
			РегистрируемоеЛицо = ДокументОснование.РегистрируемоеЛицо;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиПодчиненныйДокумент(Основание) Экспорт
	
	Перем ПодчиненныйДокумент;
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_СвидетельствоОРегистрацииПоМестуПроживания.Ссылка КАК ПодчиненныйДокумент
	|ИЗ
	|	Документ.бит_СвидетельствоОРегистрацииПоМестуПроживания КАК бит_СвидетельствоОРегистрацииПоМестуПроживания
	|ГДЕ
	|	бит_СвидетельствоОРегистрацииПоМестуПроживания.ДокументОснование = &ДокументОснование
	|	И НЕ бит_СвидетельствоОРегистрацииПоМестуПроживания.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПодчиненныйДокумент = Выборка.ПодчиненныйДокумент;
	КонецЕсли;
	
	Возврат ПодчиненныйДокумент;
	
КонецФункции

#КонецОбласти
